//Created by Action Script Viewer - http://www.buraks.com/asv
package com.assist.server {

    public class FameLevel {

        public static const Levels:Object = {
            1:[0, "无"],
            2:[1, "初阶斗者"],
            3:[2, "中阶斗者"],
            4:[3, "高阶斗者"],
            5:[4, "顶阶斗者"],
            6:[5, "初阶斗师"],
            7:[6, "中阶斗师"],
            8:[7, "高阶斗师"],
            9:[8, "顶阶斗师"],
            10:[9, "初阶大斗师"],
            11:[10, "中阶大斗师"],
            12:[11, "高阶大斗师"],
            13:[12, "顶阶大斗师"],
            14:[13, "初级斗灵"],
            15:[14, "中级斗灵"],
            16:[15, "高级斗灵"],
            17:[16, "顶级斗灵"],
            18:[17, "初阶斗王"],
            19:[18, "中阶斗王"],
            20:[19, "高阶斗王"],
            21:[20, "顶阶斗王"],
            22:[21, "初级斗皇"],
            23:[22, "中级斗皇"],
            24:[23, "高级斗皇"],
            25:[24, "顶级斗皇"],
            26:[25, "初阶斗宗"],
            27:[26, "中阶斗宗"],
            28:[27, "高阶斗宗"],
            29:[28, "顶阶斗宗"],
            30:[29, "初阶斗尊"],
            31:[30, "中阶斗尊"],
            32:[31, "高阶斗尊"],
            33:[32, "顶阶斗尊"],
            34:[33, "初阶斗圣"],
            35:[34, "中阶斗圣"],
            36:[35, "高阶斗圣"],
            37:[36, "顶阶斗圣"],
            38:[37, "初阶斗帝"],
            39:[38, "中阶斗帝"],
            40:[39, "高阶斗帝"],
            41:[40, "顶阶斗帝"],
            42:[41, "神仙"]
        };

        public static function getFameName(_arg1:int):String{
            var _local2:Array;
            for each (_local2 in Levels) {
                if (_local2[0] == _arg1){
                    return (_local2[1]);
                };
            };
            return ("");
        }

    }
}//package com.assist.server 
